<?php
$fake_data['table'] = array();
// A 30 rows data table
for($i=0;$i<100;$i++){
	$fake_data['table'][] = array(
		'data_no'=>$i,
		'col1'=>'欄位1-'.$i,
		'col2'=>'欄位2-'.$i,
		'col3'=>'欄位3-'.$i,
		'col4'=>'欄位4-'.$i,
	);
}
// 假的三層式地址選單資料
$fake_data['json']['lv1'] = '{"1":"台北","2":"桃園","3":"新竹","4":"台中"}';
$fake_data['json']['lv2'][1] = '{"1":"中山區","2":"中正區","3":"大同區","4":"松山區",}';
$fake_data['json']['lv2'][2] = '{"1":"北區","2":"中區","3":"西區","4":"東區"}';
$fake_data['json']['lv2'][3] = '{"1":"北區","2":"中區","3":"西區","4":"東區"}';
$fake_data['json']['lv2'][4] = '{"1":"北區","2":"中區","3":"西區","4":"東區"}';
$fake_data['json']['lv3'][1][1] = '{"中山區1路","中山區2路","中山區3路","中山區4路"}';
$fake_data['json']['lv3'][1][2] = '{"中正區1路","中正區2路","中正區3路","中正區4路"}';
$fake_data['json']['lv3'][1][3] = '{"大同區1路","大同區2路","大同區3路","大同區4路"}';
$fake_data['json']['lv3'][1][4] = '{"松山區1路","松山區2路","松山區3路","松山區4路"}';
$fake_data['json']['lv3'][2][1] = '{"中正路","中山路","桃園一路","桃園二路"}';
$fake_data['json']['lv3'][2][2] = '{"中正路","中山路","桃園一路","桃園二路"}';
$fake_data['json']['lv3'][2][3] = '{"中正路","中山路","桃園一路","桃園二路"}';
$fake_data['json']['lv3'][2][4] = '{"中正路","中山路","桃園一路","桃園二路"}';
$fake_data['json']['lv3'][3][1] = '{"中正路","中山路","新竹一路","新竹二路"}';
$fake_data['json']['lv3'][3][2] = '{"中正路","中山路","新竹一路","新竹二路"}';
$fake_data['json']['lv3'][3][3] = '{"中正路","中山路","新竹一路","新竹二路"}';
$fake_data['json']['lv3'][3][4] = '{"中正路","中山路","新竹一路","新竹二路"}';
$fake_data['json']['lv3'][4][1] = '{"中正路","中山路","台中路","中港路"}';
$fake_data['json']['lv3'][4][2] = '{"中正路","中山路","台中路","中港路"}';
$fake_data['json']['lv3'][4][3] = '{"中正路","中山路","台中路","中港路"}';
$fake_data['json']['lv3'][4][4] = '{"中正路","中山路","台中路","中港路"}';



//var_dump($fake_data['json']);



?>